import {Rule, RuleObject} from "rc-field-form/es/interface";

export const ACCESS_TOKEN_LIFETIME = 60_000 * 5;
export const REFRESH_TOKEN_LIFETIME = 60_000 * 60 * 24;
export const DEFAULT_LIFETIME = 60_000 * 60 * 24 * 30;

export const MESSAGE_DURATION = 4;

export const NO_HEADER_PAGES = new RegExp('/account/activate/');

export const PASSWORD_RULES = [
    {
        required: true,
        message: 'Пожалуйста, введите пароль'
    },
    {
        min: 8,
        max: 50,
        message: 'Длина пароля должна быть между 8-50 символами'
    }
];
export const RE_PASSWORD_RULES = [
    {
        required: true,
        message: 'Пожалуйста, повторно введите пароль'
    },
    ({getFieldValue}) => ({
            validator(_, value) {
                if (!value || getFieldValue('password') === value) {
                    return Promise.resolve();
                }
                return Promise.reject(new Error('Пароли не совпадают'));
            }
        }
    )
] as Rule[];

export const USERNAME_RULES = [{required: true, type: 'string', message: 'Пожалуйста, введите имя пользователя'},
    () => ({
            validator(_: RuleObject, value: string) {
                if (!value || /^[a-zA-Z0-9]+$/.test(value)) {
                    return Promise.resolve();
                }
                return Promise.reject(
                    new Error('Имя может состоять только из латинских букв или цифр'));
            }
        }
    )
] as Rule[];

export const DATE_FORMAT = 'DD.MM.YYYY';
export const USER_BIRTH_DATE_RULES = [
    {required: true, message: 'Укажите дату своего рождения'},
    () => ({
        validator(_: RuleObject, value: Date) {
            const currentDate = new Date();
            const birthDate = new Date(value);
            currentDate.setFullYear(currentDate.getFullYear() - 18);

            if (birthDate <= currentDate) return Promise.resolve();
            return Promise.reject(
                new Error('Вам не исполнилось 18 лет')
            );
        }
    })
] as Rule[];

export const FIRST_NAME_RULES = [
    {
        required: true,
        type: 'string', message: 'Пожалуйста, введите своё имя'
    },
    () => ({
            validator(_, value) {
                if (!value || [...value].every(char => isNaN(char))) {
                    return Promise.resolve();
                }
                return Promise.reject(new Error('Имя должно состоять только из букв'));
            }
        }
    )
] as Rule[];

export const LAST_NAME_RULES = [
    {
        required: true,
        type: 'string',
        message: 'Пожалуйста, введите свою фамилию'
    },
    () => ({
            validator(_, value) {
                if (!value || [...value].every(char => isNaN(char))) {
                    return Promise.resolve();
                }
                return Promise.reject(new Error('Фамилия должна состоять только из букв'));
            }
        }
    )
] as Rule[];

export const COUNTRIES = {
    "AF": "Афганистан",
    "AX": "Аландские острова",
    "AL": "Албания",
    "DZ": "Алжир",
    "AS": "Американское Самоа",
    "AD": "Андорра",
    "AO": "Ангола",
    "AI": "Ангилья",
    "AQ": "Антарктида",
    "AG": "Антигуа и Барбуда",
    "AR": "Аргентина",
    "AM": "Армения",
    "AW": "Аруба",
    "AU": "Австралия",
    "AT": "Австрия",
    "AZ": "Азербайджан",
    "BS": "Багамы",
    "BH": "Бахрейн",
    "BD": "Бангладеш",
    "BB": "Барбадос",
    "BY": "Беларусь",
    "BE": "Бельгия",
    "BZ": "Белиз",
    "BJ": "Бенин",
    "BM": "Бермуды",
    "BT": "Бутан",
    "BO": "Боливия",
    "BQ": "Бонайре, Синт-Эстатиус и Саба",
    "BA": "Босния и Герцеговина",
    "BW": "Ботсвана",
    "BV": "Остров Буве",
    "BR": "Бразилия",
    "IO": "Британская территория в Индийском океане",
    "BN": "Бруней-Даруссалам",
    "BG": "Болгария",
    "BF": "Буркина-Фасо",
    "BI": "Бурунди",
    "CV": "Кабо-Верде",
    "KH": "Камбоджа",
    "CM": "Камерун",
    "CA": "Канада",
    "KY": "Каймановы острова",
    "CF": "Центральноафриканская Республика",
    "TD": "Чад",
    "CL": "Чили",
    "CN": "Китай",
    "CX": "Остров Рождества",
    "CC": "Кокосовые острова",
    "CO": "Колумбия",
    "KM": "Коморы",
    "CG": "Конго",
    "CD": "Демократическая Республика Конго",
    "CK": "Острова Кука",
    "CR": "Коста-Рика",
    "CI": "Кот-д'Ивуар",
    "HR": "Хорватия",
    "CU": "Куба",
    "CW": "Кюрасао",
    "CY": "Кипр",
    "CZ": "Чехия",
    "DK": "Дания",
    "DJ": "Джибути",
    "DM": "Доминика",
    "DO": "Доминиканская Республика",
    "EC": "Эквадор",
    "EG": "Египет",
    "SV": "Сальвадор",
    "GQ": "Экваториальная Гвинея",
    "ER": "Эритрея",
    "EE": "Эстония",
    "SZ": "Эсватини",
    "ET": "Эфиопия",
    "FK": "Фолклендские острова (Мальвинские)",
    "FO": "Фарерские острова",
    "FJ": "Фиджи",
    "FI": "Финляндия",
    "FR": "Франция",
    "GF": "Французская Гвиана",
    "PF": "Французская Полинезия",
    "TF": "Французские Южные территории",
    "GA": "Габон",
    "GM": "Гамбия",
    "GE": "Грузия",
    "DE": "Германия",
    "GH": "Гана",
    "GI": "Гибралтар",
    "GR": "Греция",
    "GL": "Гренландия",
    "GD": "Гренада",
    "GP": "Гваделупа",
    "GU": "Гуам",
    "GT": "Гватемала",
    "GG": "Гернси",
    "GN": "Гвинея",
    "GW": "Гвинея-Бисау",
    "GY": "Гайана",
    "HT": "Гаити",
    "HM": "Остров Херд и Острова Макдональд",
    "VA": "Святой Престол (Ватикан)",
    "HN": "Гондурас",
    "HK": "Гонконг",
    "HU": "Венгрия",
    "IS": "Исландия",
    "IN": "Индия",
    "ID": "Индонезия",
    "IR": "Иран",
    "IQ": "Ирак",
    "IE": "Ирландия",
    "IM": "Остров Мэн",
    "IL": "Израиль",
    "IT": "Италия",
    "JM": "Ямайка",
    "JP": "Япония",
    "JE": "Джерси",
    "JO": "Иордания",
    "KZ": "Казахстан",
    "KE": "Кения",
    "KI": "Кирибати",
    "KP": "КНДР",
    "KR": "Республика Корея",
    "KW": "Кувейт",
    "KG": "Киргизия",
    "LA": "Лаос",
    "LV": "Латвия",
    "LB": "Ливан",
    "LS": "Лесото",
    "LR": "Либерия",
    "LY": "Ливия",
    "LI": "Лихтенштейн",
    "LT": "Литва",
    "LU": "Люксембург",
    "MO": "Макао",
    "MG": "Мадагаскар",
    "MW": "Малави",
    "MY": "Малайзия",
    "MV": "Мальдивы",
    "ML": "Мали",
    "MT": "Мальта",
    "MH": "Маршалловы Острова",
    "MQ": "Мартиника",
    "MR": "Мавритания",
    "MU": "Маврикий",
    "YT": "Майотта",
    "MX": "Мексика",
    "FM": "Федеративные Штаты Микронезии",
    "MD": "Молдавия",
    "MC": "Монако",
    "MN": "Монголия",
    "ME": "Черногория",
    "MS": "Монтсеррат",
    "MA": "Марокко",
    "MZ": "Мозамбик",
    "MM": "Мьянма",
    "NA": "Намибия",
    "NR": "Науру",
    "NP": "Непал",
    "NL": "Нидерланды",
    "NC": "Новая Каледония",
    "NZ": "Новая Зеландия",
    "NI": "Никарагуа",
    "NE": "Нигер",
    "NG": "Нигерия",
    "NU": "Ниуэ",
    "NF": "Остров Норфолк",
    "MK": "Северная Македония",
    "MP": "Северные Марианские острова",
    "NO": "Норвегия",
    "OM": "Оман",
    "PK": "Пакистан",
    "PW": "Палау",
    "PS": "Палестина",
    "PA": "Панама",
    "PG": "Папуа - Новая Гвинея",
    "PY": "Парагвай",
    "PE": "Перу",
    "PH": "Филиппины",
    "PN": "Питкэрн",
    "PL": "Польша",
    "PT": "Португалия",
    "PR": "Пуэрто-Рико",
    "QA": "Катар",
    "RE": "Реюньон",
    "RO": "Румыния",
    "RU": "Россия",
    "RW": "Руанда",
    "BL": "Сен-Бартелеми",
    "SH": "Острова Святой Елены, Вознесения и Тристан-да-Кунья",
    "KN": "Сент-Китс и Невис",
    "LC": "Сент-Люсия",
    "MF": "Сен-Мартен",
    "PM": "Сен-Пьер и Микелон",
    "VC": "Сент-Винсент и Гренадины",
    "WS": "Самоа",
    "SM": "Сан-Марино",
    "ST": "Сан-Томе и Принсипи",
    "SA": "Саудовская Аравия",
    "SN": "Сенегал",
    "RS": "Сербия",
    "SC": "Сейшелы",
    "SL": "Сьерра-Леоне",
    "SG": "Сингапур",
    "SX": "Синт-Мартен",
    "SK": "Словакия",
    "SI": "Словения",
    "SB": "Соломоновы острова",
    "SO": "Сомали",
    "ZA": "Южная Африка",
    "GS": "Южная Георгия и Южные Сандвичевы острова",
    "SS": "Южный Судан",
    "ES": "Испания",
    "LK": "Шри-Ланка",
    "SD": "Судан",
    "SR": "Суринам",
    "SJ": "Шпицберген и Ян-Майен",
    "SE": "Швеция",
    "CH": "Швейцария",
    "SY": "Сирия",
    "TW": "Тайвань",
    "TJ": "Таджикистан",
    "TZ": "Танзания",
    "TH": "Таиланд",
    "TL": "Тимор-Лешти",
    "TG": "Того",
    "TK": "Токелау",
    "TO": "Тонга",
    "TT": "Тринидад и Тобаго",
    "TN": "Тунис",
    "TR": "Турция",
    "TM": "Туркмения",
    "TC": "Теркс и Кайкос",
    "TV": "Тувалу",
    "UG": "Уганда",
    "UA": "Украина",
    "AE": "ОАЭ",
    "GB": "Великобритания",
    "UM": "Малые Тихоокеанские отдаленные острова США",
    "US": "США",
    "UY": "Уругвай",
    "UZ": "Узбекистан",
    "VU": "Вануату",
    "VE": "Венесуэла",
    "VN": "Вьетнам",
    "VG": "Виргинские острова (Британские)",
    "VI": "Виргинские острова (США)",
    "WF": "Уоллис и Футуна",
    "EH": "Западная Сахара",
    "YE": "Йемен",
    "ZM": "Замбия",
    "ZW": "Зимбабве",
}
